app/controllers/home_controller.rb

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
---
  def show
    @product_type = ProductType.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_cart
    product = Product.find(params[:id])