app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    @products = Product.all

INSERT INTO `products` (`price`, `created_at`, `title`, `image_url`, `updated_at`, `product_type_id`, `description`) VALUES(30.0, '2010-04-04 22:49:56', 'Mostarda', 'http://tadificil.files.wordpress.com/2007/09/mostarda.jpg', '2010-04-04 22:49:56', 2, 'CD do mostarda da lagarta')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `title` = 'Diamante Negro 30g', `product_type_id` = 2, `updated_at` = '2010-04-01 03:30:42', `image_url` = 'http://www.blogracio.com/uploaded_images/Diamante_Negro-759101.jpg' WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])