app/controllers/product_types_controller.rb

SELECT * FROM `product_types`
---
  def index
    @product_types = ProductType.all

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
---
  def show
    @product_type = ProductType.find(params[:id])

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
---
  def edit
    @product_type = ProductType.find(params[:id])

INSERT INTO `product_types` (`created_at`, `title`, `updated_at`) VALUES('2010-04-04 22:47:29', 'SmartPhone', '2010-04-04 22:47:29')
---
  def create
    @product_type = ProductType.new(params[:product_type])

    respond_to do |format|
      if @product_type.save

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
UPDATE `product_types` SET `title` = 'Flores', `updated_at` = '2010-04-01 03:28:44' WHERE `id` = 1
---
  def update
    @product_type = ProductType.find(params[:id])

    respond_to do |format|
      if @product_type.update_attributes(params[:product_type])

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
DELETE FROM `product_types` WHERE `id` = 1
---
  def destroy
    @product_type = ProductType.find(params[:id])
    @product_type.destroy